(env) C:\Users\Veda\Documents\CSE847\project\dnn_examples>python train_cifar10_dnn_standardised.py
Using TensorFlow backend.
Input shape: (50000, 32, 32, 3)
Output shape: (50000, 10)
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   448         input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2320        activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2320        activation_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 16)   64          conv2d_3[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           activation_1[0][0]
                                                                 batch_normalization_3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2320        activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 16)   64          conv2d_4[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2320        activation_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 16)   64          conv2d_5[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           activation_3[0][0]
                                                                 batch_normalization_5[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 16)   2320        activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 16)   64          conv2d_6[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 16)   2320        activation_6[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 16)   64          conv2d_7[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           activation_5[0][0]
                                                                 batch_normalization_7[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   4640        activation_7[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 32)   128         conv2d_8[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9248        activation_8[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 32)   544         activation_7[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 32)   128         conv2d_9[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           conv2d_10[0][0]
                                                                 batch_normalization_9[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 32)   9248        activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 32)   128         conv2d_11[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 32)   9248        activation_10[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 32)   128         conv2d_12[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           activation_9[0][0]
                                                                 batch_normalization_11[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 32)   9248        activation_11[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 32)   128         conv2d_13[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 32)   9248        activation_12[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 32)   128         conv2d_14[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           activation_11[0][0]
                                                                 batch_normalization_13[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     18496       activation_13[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 64)     256         conv2d_15[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 64)     36928       activation_14[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 64)     2112        activation_13[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 64)     256         conv2d_16[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           conv2d_17[0][0]
                                                                 batch_normalization_15[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 64)     36928       activation_15[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 64)     256         conv2d_18[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 64)     36928       activation_16[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 64)     256         conv2d_19[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           activation_15[0][0]
                                                                 batch_normalization_17[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 64)     36928       activation_17[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 64)     256         conv2d_20[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 64)     36928       activation_18[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 64)     256         conv2d_21[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           activation_17[0][0]
                                                                 batch_normalization_19[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 64)           0           activation_19[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           650         global_average_pooling2d_1[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 10)           0           dense_1[0][0]
==================================================================================================
Total params: 274,442
Trainable params: 273,066
Non-trainable params: 1,376
__________________________________________________________________________________________________
Training...
Epoch 1/250
50000/50000 [==============================] - 25s 490us/step - loss: 1.6800 - acc: 0.4585
Epoch 2/250
50000/50000 [==============================] - 14s 279us/step - loss: 1.2400 - acc: 0.6127
Epoch 3/250
50000/50000 [==============================] - 18s 365us/step - loss: 1.0553 - acc: 0.6804
Epoch 4/250
50000/50000 [==============================] - 18s 361us/step - loss: 0.9313 - acc: 0.7230
Epoch 5/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.8364 - acc: 0.7582
Epoch 6/250
50000/50000 [==============================] - 18s 363us/step - loss: 0.7544 - acc: 0.7866
Epoch 7/250
50000/50000 [==============================] - 19s 371us/step - loss: 0.6835 - acc: 0.8118
Epoch 8/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.6192 - acc: 0.8351
Epoch 9/250
50000/50000 [==============================] - 19s 372us/step - loss: 0.5621 - acc: 0.8564
Epoch 10/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.5081 - acc: 0.8750
Epoch 11/250
50000/50000 [==============================] - 18s 357us/step - loss: 0.4633 - acc: 0.8916
Epoch 12/250
50000/50000 [==============================] - 18s 365us/step - loss: 0.4195 - acc: 0.9086
Epoch 13/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.3897 - acc: 0.9176
Epoch 14/250
50000/50000 [==============================] - 18s 360us/step - loss: 0.3638 - acc: 0.9276
Epoch 15/250
50000/50000 [==============================] - 18s 354us/step - loss: 0.3349 - acc: 0.9389
Epoch 16/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.3084 - acc: 0.9486
Epoch 17/250
50000/50000 [==============================] - 19s 378us/step - loss: 0.2971 - acc: 0.9517
Epoch 18/250
50000/50000 [==============================] - 19s 370us/step - loss: 0.2874 - acc: 0.9552
Epoch 19/250
50000/50000 [==============================] - 18s 362us/step - loss: 0.2763 - acc: 0.9595
Epoch 20/250
50000/50000 [==============================] - 18s 369us/step - loss: 0.2793 - acc: 0.9573
Epoch 21/250
50000/50000 [==============================] - 19s 375us/step - loss: 0.2728 - acc: 0.9609
Epoch 22/250
50000/50000 [==============================] - 19s 371us/step - loss: 0.2691 - acc: 0.9617
Epoch 23/250
50000/50000 [==============================] - 18s 363us/step - loss: 0.2622 - acc: 0.9643
Epoch 24/250
50000/50000 [==============================] - 19s 370us/step - loss: 0.2478 - acc: 0.9712
Epoch 25/250
50000/50000 [==============================] - 18s 366us/step - loss: 0.2480 - acc: 0.9705
Epoch 26/250
50000/50000 [==============================] - 13s 263us/step - loss: 0.2580 - acc: 0.9666
Epoch 27/250
50000/50000 [==============================] - 15s 290us/step - loss: 0.2551 - acc: 0.9679
Epoch 28/250
50000/50000 [==============================] - 15s 295us/step - loss: 0.2494 - acc: 0.9702
Epoch 29/250
50000/50000 [==============================] - 16s 324us/step - loss: 0.2521 - acc: 0.9693
Epoch 30/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.2572 - acc: 0.9669
Epoch 31/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.2309 - acc: 0.9775
Epoch 32/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.2272 - acc: 0.9782
Epoch 33/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.2488 - acc: 0.9702
Epoch 34/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.2459 - acc: 0.9716
Epoch 35/250
50000/50000 [==============================] - 18s 368us/step - loss: 0.2418 - acc: 0.9733
Epoch 36/250
50000/50000 [==============================] - 18s 366us/step - loss: 0.2435 - acc: 0.9728
Epoch 37/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.2311 - acc: 0.9777
Epoch 38/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.2328 - acc: 0.9765
Epoch 39/250
50000/50000 [==============================] - 19s 374us/step - loss: 0.2296 - acc: 0.9780
Epoch 40/250
50000/50000 [==============================] - 19s 375us/step - loss: 0.2393 - acc: 0.9743
Epoch 41/250
50000/50000 [==============================] - 26s 525us/step - loss: 0.2438 - acc: 0.9731
Epoch 42/250
50000/50000 [==============================] - 62s 1ms/step - loss: 0.2332 - acc: 0.9776
Epoch 43/250
50000/50000 [==============================] - 63s 1ms/step - loss: 0.2347 - acc: 0.9768
Epoch 44/250
50000/50000 [==============================] - 39s 783us/step - loss: 0.2416 - acc: 0.9741
Epoch 45/250
50000/50000 [==============================] - 19s 384us/step - loss: 0.2348 - acc: 0.9765
Epoch 46/250
50000/50000 [==============================] - 19s 385us/step - loss: 0.2411 - acc: 0.9751
Epoch 47/250
50000/50000 [==============================] - 19s 371us/step - loss: 0.2420 - acc: 0.9745
Epoch 48/250
50000/50000 [==============================] - 18s 369us/step - loss: 0.2275 - acc: 0.9791
Epoch 49/250
50000/50000 [==============================] - 19s 376us/step - loss: 0.2281 - acc: 0.9793
Epoch 50/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.2248 - acc: 0.9798
Epoch 51/250
50000/50000 [==============================] - 18s 369us/step - loss: 0.2303 - acc: 0.9783
Epoch 52/250
50000/50000 [==============================] - 19s 380us/step - loss: 0.2544 - acc: 0.9700
Epoch 53/250
50000/50000 [==============================] - 19s 378us/step - loss: 0.2260 - acc: 0.9808
Epoch 54/250
50000/50000 [==============================] - 19s 371us/step - loss: 0.2172 - acc: 0.9832
Epoch 55/250
50000/50000 [==============================] - 16s 315us/step - loss: 0.2336 - acc: 0.9773
Epoch 56/250
50000/50000 [==============================] - 14s 277us/step - loss: 0.2356 - acc: 0.9770
Epoch 57/250
50000/50000 [==============================] - 14s 282us/step - loss: 0.2396 - acc: 0.9750
Epoch 58/250
50000/50000 [==============================] - 15s 302us/step - loss: 0.2256 - acc: 0.9808
Epoch 59/250
50000/50000 [==============================] - 18s 361us/step - loss: 0.2245 - acc: 0.9812
Epoch 60/250
50000/50000 [==============================] - 18s 351us/step - loss: 0.2193 - acc: 0.9825
Epoch 61/250
50000/50000 [==============================] - 16s 328us/step - loss: 0.2436 - acc: 0.9739
Epoch 62/250
50000/50000 [==============================] - 17s 343us/step - loss: 0.2371 - acc: 0.9763
Epoch 63/250
50000/50000 [==============================] - 18s 359us/step - loss: 0.2187 - acc: 0.9834
Epoch 64/250
50000/50000 [==============================] - 18s 362us/step - loss: 0.2183 - acc: 0.9828
Epoch 65/250
50000/50000 [==============================] - 18s 352us/step - loss: 0.2303 - acc: 0.9790
Epoch 66/250
50000/50000 [==============================] - 20s 409us/step - loss: 0.2350 - acc: 0.9769
Epoch 67/250
50000/50000 [==============================] - 18s 359us/step - loss: 0.2340 - acc: 0.9785
Epoch 68/250
50000/50000 [==============================] - 18s 368us/step - loss: 0.2275 - acc: 0.9800
Epoch 69/250
50000/50000 [==============================] - 18s 360us/step - loss: 0.2163 - acc: 0.9840
Epoch 70/250
50000/50000 [==============================] - 18s 362us/step - loss: 0.2181 - acc: 0.9828
Epoch 71/250
50000/50000 [==============================] - 18s 360us/step - loss: 0.2399 - acc: 0.9756
Epoch 72/250
50000/50000 [==============================] - 18s 357us/step - loss: 0.2348 - acc: 0.9773
Epoch 73/250
50000/50000 [==============================] - 18s 365us/step - loss: 0.2308 - acc: 0.9793
Epoch 74/250
50000/50000 [==============================] - 18s 362us/step - loss: 0.2237 - acc: 0.9815
Epoch 75/250
50000/50000 [==============================] - 18s 360us/step - loss: 0.2174 - acc: 0.9843
Epoch 76/250
50000/50000 [==============================] - 18s 368us/step - loss: 0.2234 - acc: 0.9808
Epoch 77/250
50000/50000 [==============================] - 18s 370us/step - loss: 0.2312 - acc: 0.9784
Epoch 78/250
50000/50000 [==============================] - 18s 359us/step - loss: 0.2179 - acc: 0.9831
Epoch 79/250
50000/50000 [==============================] - 18s 361us/step - loss: 0.2256 - acc: 0.9806
Epoch 80/250
50000/50000 [==============================] - 18s 352us/step - loss: 0.2355 - acc: 0.9767
Epoch 81/250
50000/50000 [==============================] - 18s 360us/step - loss: 0.2145 - acc: 0.9847
Epoch 82/250
50000/50000 [==============================] - 18s 362us/step - loss: 0.1880 - acc: 0.9945
Epoch 83/250
50000/50000 [==============================] - 18s 356us/step - loss: 0.1745 - acc: 0.9996
Epoch 84/250
50000/50000 [==============================] - 17s 350us/step - loss: 0.1718 - acc: 1.0000
Epoch 85/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.1706 - acc: 0.9999
Epoch 86/250
50000/50000 [==============================] - 17s 331us/step - loss: 0.1694 - acc: 0.9999
Epoch 87/250
50000/50000 [==============================] - 17s 337us/step - loss: 0.1684 - acc: 1.0000
Epoch 88/250
50000/50000 [==============================] - 17s 345us/step - loss: 0.1673 - acc: 1.0000
Epoch 89/250
50000/50000 [==============================] - 17s 333us/step - loss: 0.1661 - acc: 1.0000
Epoch 90/250
50000/50000 [==============================] - 17s 337us/step - loss: 0.1651 - acc: 1.0000
Epoch 91/250
50000/50000 [==============================] - 17s 337us/step - loss: 0.1638 - acc: 1.0000
Epoch 92/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.1625 - acc: 1.0000
Epoch 93/250
50000/50000 [==============================] - 17s 343us/step - loss: 0.1612 - acc: 1.0000
Epoch 94/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.1598 - acc: 1.0000
Epoch 95/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.1582 - acc: 1.0000
Epoch 96/250
50000/50000 [==============================] - 17s 347us/step - loss: 0.1566 - acc: 1.0000
Epoch 97/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.1547 - acc: 1.0000
Epoch 98/250
50000/50000 [==============================] - 18s 364us/step - loss: 0.1529 - acc: 1.0000
Epoch 99/250
50000/50000 [==============================] - 14s 271us/step - loss: 0.1508 - acc: 1.0000
Epoch 100/250
50000/50000 [==============================] - 14s 270us/step - loss: 0.1486 - acc: 1.0000
Epoch 101/250
50000/50000 [==============================] - 20s 406us/step - loss: 0.1462 - acc: 1.0000
Epoch 102/250
50000/50000 [==============================] - 17s 345us/step - loss: 0.1438 - acc: 1.0000
Epoch 103/250
50000/50000 [==============================] - 16s 326us/step - loss: 0.1411 - acc: 1.0000
Epoch 104/250
50000/50000 [==============================] - 16s 325us/step - loss: 0.1383 - acc: 1.0000
Epoch 105/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.1353 - acc: 1.0000
Epoch 106/250
50000/50000 [==============================] - 17s 341us/step - loss: 0.1321 - acc: 1.0000
Epoch 107/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.1288 - acc: 1.0000
Epoch 108/250
50000/50000 [==============================] - 16s 325us/step - loss: 0.1253 - acc: 1.0000
Epoch 109/250
50000/50000 [==============================] - 16s 330us/step - loss: 0.1216 - acc: 1.0000
Epoch 110/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.1178 - acc: 1.0000
Epoch 111/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.1139 - acc: 1.0000
Epoch 112/250
50000/50000 [==============================] - 17s 338us/step - loss: 0.1099 - acc: 1.0000
Epoch 113/250
50000/50000 [==============================] - 17s 333us/step - loss: 0.1121 - acc: 0.9980
Epoch 114/250
50000/50000 [==============================] - 17s 331us/step - loss: 0.1086 - acc: 0.9993
Epoch 115/250
50000/50000 [==============================] - 17s 341us/step - loss: 0.1063 - acc: 0.9998
Epoch 116/250
50000/50000 [==============================] - 17s 340us/step - loss: 0.1043 - acc: 1.0000
Epoch 117/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.1031 - acc: 1.0000
Epoch 118/250
50000/50000 [==============================] - 17s 340us/step - loss: 0.1020 - acc: 1.0000
Epoch 119/250
50000/50000 [==============================] - 17s 340us/step - loss: 0.1009 - acc: 1.0000
Epoch 120/250
50000/50000 [==============================] - 15s 298us/step - loss: 0.0997 - acc: 1.0000
Epoch 121/250
50000/50000 [==============================] - 13s 260us/step - loss: 0.0985 - acc: 1.0000
Epoch 122/250
50000/50000 [==============================] - 33s 663us/step - loss: 0.0977 - acc: 1.0000
Epoch 123/250
50000/50000 [==============================] - 57s 1ms/step - loss: 0.0975 - acc: 1.0000
Epoch 124/250
50000/50000 [==============================] - 17s 334us/step - loss: 0.0974 - acc: 1.0000
Epoch 125/250
50000/50000 [==============================] - 17s 339us/step - loss: 0.0972 - acc: 1.0000
Epoch 126/250
50000/50000 [==============================] - 17s 333us/step - loss: 0.0970 - acc: 1.0000
Epoch 127/250
50000/50000 [==============================] - 16s 330us/step - loss: 0.0967 - acc: 1.0000
Epoch 128/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.0965 - acc: 1.0000
Epoch 129/250
50000/50000 [==============================] - 17s 334us/step - loss: 0.0963 - acc: 1.0000
Epoch 130/250
50000/50000 [==============================] - 16s 329us/step - loss: 0.0960 - acc: 1.0000
Epoch 131/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.0957 - acc: 1.0000
Epoch 132/250
50000/50000 [==============================] - 17s 343us/step - loss: 0.0953 - acc: 1.0000
Epoch 133/250
50000/50000 [==============================] - 17s 341us/step - loss: 0.0950 - acc: 1.0000
Epoch 134/250
50000/50000 [==============================] - 17s 343us/step - loss: 0.0946 - acc: 1.0000
Epoch 135/250
50000/50000 [==============================] - 18s 353us/step - loss: 0.0942 - acc: 1.0000
Epoch 136/250
50000/50000 [==============================] - 17s 343us/step - loss: 0.0937 - acc: 1.0000
Epoch 137/250
50000/50000 [==============================] - 17s 344us/step - loss: 0.0932 - acc: 1.0000
Epoch 138/250
50000/50000 [==============================] - 17s 345us/step - loss: 0.0927 - acc: 1.0000
Epoch 139/250
50000/50000 [==============================] - 17s 345us/step - loss: 0.0921 - acc: 1.0000
Epoch 140/250
50000/50000 [==============================] - 17s 347us/step - loss: 0.0915 - acc: 1.0000
Epoch 141/250
50000/50000 [==============================] - 17s 340us/step - loss: 0.0909 - acc: 1.0000
Epoch 142/250
50000/50000 [==============================] - 17s 349us/step - loss: 0.0902 - acc: 1.0000
Epoch 143/250
50000/50000 [==============================] - 17s 348us/step - loss: 0.0895 - acc: 1.0000
Epoch 144/250
50000/50000 [==============================] - 18s 352us/step - loss: 0.0887 - acc: 1.0000
Epoch 145/250
50000/50000 [==============================] - 17s 349us/step - loss: 0.0879 - acc: 1.0000
Epoch 146/250
50000/50000 [==============================] - 17s 348us/step - loss: 0.0872 - acc: 1.0000
Epoch 147/250
50000/50000 [==============================] - 18s 353us/step - loss: 0.0866 - acc: 1.0000
Epoch 148/250
50000/50000 [==============================] - 18s 353us/step - loss: 0.0861 - acc: 1.0000
Epoch 149/250
50000/50000 [==============================] - 18s 362us/step - loss: 0.0855 - acc: 1.0000
Epoch 150/250
50000/50000 [==============================] - 18s 367us/step - loss: 0.0850 - acc: 1.0000
Epoch 151/250
50000/50000 [==============================] - 17s 350us/step - loss: 0.0846 - acc: 1.0000
Epoch 152/250
50000/50000 [==============================] - 17s 333us/step - loss: 0.0843 - acc: 1.0000
Epoch 153/250
50000/50000 [==============================] - 12s 249us/step - loss: 0.0839 - acc: 1.0000
Epoch 154/250
50000/50000 [==============================] - 14s 273us/step - loss: 0.0834 - acc: 1.0000
Epoch 155/250
50000/50000 [==============================] - 13s 258us/step - loss: 0.0830 - acc: 1.0000
Epoch 156/250
50000/50000 [==============================] - 13s 260us/step - loss: 0.0825 - acc: 1.0000
Epoch 157/250
50000/50000 [==============================] - 13s 264us/step - loss: 0.0819 - acc: 1.0000
Epoch 158/250
50000/50000 [==============================] - 12s 249us/step - loss: 0.0814 - acc: 1.0000
Epoch 159/250
50000/50000 [==============================] - 13s 251us/step - loss: 0.0809 - acc: 1.0000
Epoch 160/250
50000/50000 [==============================] - 12s 248us/step - loss: 0.0804 - acc: 1.0000
Epoch 161/250
50000/50000 [==============================] - 12s 247us/step - loss: 0.0799 - acc: 1.0000
Epoch 162/250
50000/50000 [==============================] - 13s 254us/step - loss: 0.0797 - acc: 1.0000
Epoch 163/250
50000/50000 [==============================] - 13s 264us/step - loss: 0.0796 - acc: 1.0000
Epoch 164/250
50000/50000 [==============================] - 13s 250us/step - loss: 0.0796 - acc: 1.0000
Epoch 165/250
50000/50000 [==============================] - 13s 268us/step - loss: 0.0795 - acc: 1.0000
Epoch 166/250
50000/50000 [==============================] - 14s 282us/step - loss: 0.0794 - acc: 1.0000
Epoch 167/250
50000/50000 [==============================] - 16s 312us/step - loss: 0.0793 - acc: 1.0000
Epoch 168/250
50000/50000 [==============================] - 15s 302us/step - loss: 0.0793 - acc: 1.0000
Epoch 169/250
50000/50000 [==============================] - 15s 293us/step - loss: 0.0792 - acc: 1.0000
Epoch 170/250
50000/50000 [==============================] - 14s 283us/step - loss: 0.0791 - acc: 1.0000
Epoch 171/250
50000/50000 [==============================] - 13s 269us/step - loss: 0.0790 - acc: 1.0000
Epoch 172/250
50000/50000 [==============================] - 13s 266us/step - loss: 0.0789 - acc: 1.0000
Epoch 173/250
50000/50000 [==============================] - 13s 265us/step - loss: 0.0789 - acc: 1.0000
Epoch 174/250
50000/50000 [==============================] - 14s 279us/step - loss: 0.0788 - acc: 1.0000
Epoch 175/250
50000/50000 [==============================] - 14s 271us/step - loss: 0.0787 - acc: 1.0000
Epoch 176/250
50000/50000 [==============================] - 14s 287us/step - loss: 0.0786 - acc: 1.0000
Epoch 177/250
50000/50000 [==============================] - 14s 276us/step - loss: 0.0785 - acc: 1.0000
Epoch 178/250
50000/50000 [==============================] - 13s 269us/step - loss: 0.0784 - acc: 1.0000
Epoch 179/250
50000/50000 [==============================] - 14s 278us/step - loss: 0.0784 - acc: 1.0000
Epoch 180/250
50000/50000 [==============================] - 14s 275us/step - loss: 0.0783 - acc: 1.0000
Epoch 181/250
50000/50000 [==============================] - 14s 282us/step - loss: 0.0782 - acc: 1.0000
Epoch 182/250
50000/50000 [==============================] - 13s 268us/step - loss: 0.0782 - acc: 1.0000
Epoch 183/250
50000/50000 [==============================] - 14s 276us/step - loss: 0.0781 - acc: 1.0000
Epoch 184/250
50000/50000 [==============================] - 14s 284us/step - loss: 0.0781 - acc: 1.0000
Epoch 185/250
50000/50000 [==============================] - 15s 294us/step - loss: 0.0781 - acc: 1.0000
Epoch 186/250
50000/50000 [==============================] - 14s 271us/step - loss: 0.0780 - acc: 1.0000
Epoch 187/250
50000/50000 [==============================] - 14s 273us/step - loss: 0.0780 - acc: 1.0000
Epoch 188/250
50000/50000 [==============================] - 15s 293us/step - loss: 0.0780 - acc: 1.0000
Epoch 189/250
50000/50000 [==============================] - 14s 289us/step - loss: 0.0779 - acc: 1.0000
Epoch 190/250
50000/50000 [==============================] - 14s 289us/step - loss: 0.0779 - acc: 1.0000
Epoch 191/250
50000/50000 [==============================] - 15s 294us/step - loss: 0.0779 - acc: 1.0000
Epoch 192/250
50000/50000 [==============================] - 14s 289us/step - loss: 0.0778 - acc: 1.0000
Epoch 193/250
50000/50000 [==============================] - 14s 287us/step - loss: 0.0778 - acc: 1.0000
Epoch 194/250
50000/50000 [==============================] - 13s 266us/step - loss: 0.0778 - acc: 1.0000
Epoch 195/250
50000/50000 [==============================] - 13s 260us/step - loss: 0.0777 - acc: 1.0000
Epoch 196/250
50000/50000 [==============================] - 13s 264us/step - loss: 0.0777 - acc: 1.0000
Epoch 197/250
50000/50000 [==============================] - 13s 267us/step - loss: 0.0776 - acc: 1.0000
Epoch 198/250
50000/50000 [==============================] - 13s 267us/step - loss: 0.0776 - acc: 1.0000
Epoch 199/250
50000/50000 [==============================] - 13s 265us/step - loss: 0.0775 - acc: 1.0000
Epoch 200/250
50000/50000 [==============================] - 13s 267us/step - loss: 0.0775 - acc: 1.0000
Epoch 201/250
50000/50000 [==============================] - 13s 267us/step - loss: 0.0774 - acc: 1.0000
Epoch 202/250
50000/50000 [==============================] - 13s 267us/step - loss: 0.0774 - acc: 1.0000
Epoch 203/250
50000/50000 [==============================] - 13s 269us/step - loss: 0.0773 - acc: 1.0000
Epoch 204/250
50000/50000 [==============================] - 14s 274us/step - loss: 0.0773 - acc: 1.0000
Epoch 205/250
50000/50000 [==============================] - 13s 269us/step - loss: 0.0772 - acc: 1.0000
Epoch 206/250
50000/50000 [==============================] - 14s 272us/step - loss: 0.0772 - acc: 1.0000
Epoch 207/250
50000/50000 [==============================] - 14s 273us/step - loss: 0.0772 - acc: 1.0000
Epoch 208/250
50000/50000 [==============================] - 14s 279us/step - loss: 0.0771 - acc: 1.0000
Epoch 209/250
50000/50000 [==============================] - 14s 274us/step - loss: 0.0771 - acc: 1.0000
Epoch 210/250
50000/50000 [==============================] - 13s 266us/step - loss: 0.0770 - acc: 1.0000
Epoch 211/250
50000/50000 [==============================] - 17s 349us/step - loss: 0.0770 - acc: 1.0000
Epoch 212/250
50000/50000 [==============================] - 17s 345us/step - loss: 0.0769 - acc: 1.0000
Epoch 213/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.0769 - acc: 1.0000
Epoch 214/250
50000/50000 [==============================] - 17s 335us/step - loss: 0.0768 - acc: 1.0000
Epoch 215/250
50000/50000 [==============================] - 16s 329us/step - loss: 0.0767 - acc: 1.0000
Epoch 216/250
50000/50000 [==============================] - 16s 328us/step - loss: 0.0767 - acc: 1.0000
Epoch 217/250
50000/50000 [==============================] - 16s 330us/step - loss: 0.0766 - acc: 1.0000
Epoch 218/250
50000/50000 [==============================] - 16s 330us/step - loss: 0.0766 - acc: 1.0000
Epoch 219/250
50000/50000 [==============================] - 16s 330us/step - loss: 0.0765 - acc: 1.0000
Epoch 220/250
50000/50000 [==============================] - 17s 332us/step - loss: 0.0765 - acc: 1.0000
Epoch 221/250
50000/50000 [==============================] - 17s 339us/step - loss: 0.0764 - acc: 1.0000
Epoch 222/250
50000/50000 [==============================] - 17s 337us/step - loss: 0.0764 - acc: 1.0000
Epoch 223/250
50000/50000 [==============================] - 18s 354us/step - loss: 0.0763 - acc: 1.0000
Epoch 224/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.0763 - acc: 1.0000
Epoch 225/250
50000/50000 [==============================] - 17s 342us/step - loss: 0.0762 - acc: 1.0000
Epoch 226/250
50000/50000 [==============================] - 17s 343us/step - loss: 0.0762 - acc: 1.0000
Epoch 227/250
50000/50000 [==============================] - 17s 346us/step - loss: 0.0761 - acc: 1.0000
Epoch 228/250
50000/50000 [==============================] - 17s 350us/step - loss: 0.0761 - acc: 1.0000
Epoch 229/250
50000/50000 [==============================] - 14s 276us/step - loss: 0.0761 - acc: 1.0000
Epoch 230/250
50000/50000 [==============================] - 19s 389us/step - loss: 0.0760 - acc: 1.0000
Epoch 231/250
50000/50000 [==============================] - 17s 330us/step - loss: 0.0760 - acc: 1.0000
Epoch 232/250
50000/50000 [==============================] - 16s 326us/step - loss: 0.0759 - acc: 1.0000
Epoch 233/250
50000/50000 [==============================] - 17s 334us/step - loss: 0.0759 - acc: 1.0000
Epoch 234/250
50000/50000 [==============================] - 19s 378us/step - loss: 0.0758 - acc: 1.0000
Epoch 235/250
50000/50000 [==============================] - 19s 375us/step - loss: 0.0758 - acc: 1.0000
Epoch 236/250
50000/50000 [==============================] - 18s 361us/step - loss: 0.0758 - acc: 1.0000
Epoch 237/250
50000/50000 [==============================] - 17s 334us/step - loss: 0.0757 - acc: 1.0000
Epoch 238/250
50000/50000 [==============================] - 17s 333us/step - loss: 0.0757 - acc: 1.0000
Epoch 239/250
50000/50000 [==============================] - 17s 345us/step - loss: 0.0757 - acc: 1.0000
Epoch 240/250
50000/50000 [==============================] - 17s 347us/step - loss: 0.0756 - acc: 1.0000
Epoch 241/250
50000/50000 [==============================] - 18s 351us/step - loss: 0.0756 - acc: 1.0000
Epoch 242/250
50000/50000 [==============================] - 17s 341us/step - loss: 0.0756 - acc: 1.0000
Epoch 243/250
50000/50000 [==============================] - 18s 350us/step - loss: 0.0756 - acc: 1.0000
Epoch 244/250
50000/50000 [==============================] - 17s 341us/step - loss: 0.0755 - acc: 1.0000
Epoch 245/250
50000/50000 [==============================] - 18s 350us/step - loss: 0.0755 - acc: 1.0000
Epoch 246/250
50000/50000 [==============================] - 17s 344us/step - loss: 0.0754 - acc: 1.0000
Epoch 247/250
50000/50000 [==============================] - 18s 353us/step - loss: 0.0754 - acc: 1.0000
Epoch 248/250
50000/50000 [==============================] - 18s 353us/step - loss: 0.0754 - acc: 1.0000
Epoch 249/250
50000/50000 [==============================] - 18s 352us/step - loss: 0.0753 - acc: 1.0000
Epoch 250/250
50000/50000 [==============================] - 18s 355us/step - loss: 0.0753 - acc: 1.0000
Evaluating against test data...
Loss:     1.559
Accuracy: 0.777
