Loading cifar10_dnn.h5...
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2320        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           activation_1[0][0]               
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2320        activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2320        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 16)   64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           activation_3[0][0]               
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 16)   2320        activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 16)   2320        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 16)   64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           activation_5[0][0]               
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   4640        activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 32)   128         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9248        activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 32)   544         activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           conv2d_10[0][0]                  
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 32)   9248        activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 32)   128         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 32)   9248        activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 32)   128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           activation_9[0][0]               
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 32)   9248        activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 32)   128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 32)   9248        activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 32)   128         conv2d_14[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           activation_11[0][0]              
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     18496       activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 64)     256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 64)     36928       activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 64)     2112        activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 64)     256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           conv2d_17[0][0]                  
                                                                 batch_normalization_15[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 64)     36928       activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 64)     256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 64)     36928       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 64)     256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           activation_15[0][0]              
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 64)     36928       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 64)     256         conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 64)     36928       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 64)     256         conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           activation_17[0][0]              
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 64)           0           activation_19[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           650         global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 10)           0           dense_1[0][0]                    
==================================================================================================
Total params: 274,442
Trainable params: 273,066
Non-trainable params: 1,376
__________________________________________________________________________________________________
Input shape: (50000, 32, 32, 3)
Output shape: (50000, 10)
Image Number: 9457
6
Prediction: [[5.0373099e-08 1.1045592e-05 9.6067720e-07 5.4070961e-06 1.2649910e-08
  3.5084446e-04 9.9963164e-01 1.1951858e-09 1.8750839e-09 1.2487702e-09]]
Prediction: frog
Prediction: 6
Prediction: 0.9996316432952881
End of generation: 0; Best performing member: 103.94061017036438; Worse performing member: 238.68297344185936
50
End of generation: 0; Best performing member: 103.95224477350712; Worse performing member: 238.85259120856927
77
End of generation: 0; Best performing member: 103.95348447561264; Worse performing member: 241.697248621003
53
End of generation: 0; Best performing member: 103.94900220632553; Worse performing member: 241.70629668382662
25
End of generation: 0; Best performing member: 103.95792517066002; Worse performing member: 235.68980404529725
End of generation: 100; Best performing member: 204.30566412488207; Worse performing member: 219.13810123627198
106

----- Results ------

Adversarial Example produced.
L2 norm difference: 0.46
L1 norm difference: 18
Prediction: [[1.7083637e-05 8.2019641e-04 1.1361535e-05 1.2717082e-04 3.0081712e-06
  5.0575751e-01 4.9326319e-01 2.5080683e-07 1.3040632e-07 1.6990276e-07]]
Prediction: dog
Prediction: 5
Prediction: 0.5057575106620789


Adversarial Example produced.
L2 norm difference: 0.53
L1 norm difference: 27
Prediction: [[4.9906517e-03 4.6933364e-04 1.2360602e-03 6.6186625e-01 1.9267532e-04
  1.2043994e-02 3.1919405e-01 3.8267444e-06 6.5146003e-07 2.4699755e-06]]
Prediction: cat
Prediction: 3
Prediction: 0.6618662476539612


Adversarial Example produced.
L2 norm difference: 0.58
L1 norm difference: 33
Prediction: [[3.8072531e-06 3.4940157e-03 6.6502976e-06 4.6445490e-05 5.0149288e-07
  5.0751090e-01 4.8893604e-01 1.5121074e-06 2.6438530e-08 8.7739402e-08]]
Prediction: dog
Prediction: 5
Prediction: 0.5075109004974365


Adversarial Example produced.
L2 norm difference: 0.64
L1 norm difference: 41
Prediction: [[6.0303701e-04 1.8040931e-03 4.9315381e-04 6.5628381e-04 6.7070156e-05
  5.1901305e-01 4.7732550e-01 3.6589179e-05 5.4939619e-08 1.2108394e-06]]
Prediction: dog
Prediction: 5
Prediction: 0.5190130472183228


Adversarial Example produced.
L2 norm difference: 0.65
L1 norm difference: 42
Prediction: [[3.1455963e-06 2.3916793e-04 2.4510325e-07 6.7755260e-05 9.0911271e-08
  5.6936616e-01 4.3032336e-01 5.2867104e-08 3.2576424e-09 3.6901533e-09]]
Prediction: dog
Prediction: 5
Prediction: 0.5693661570549011


 
----- EXPERIMENT 2: Parallel GA -----
parallelGA start
End of generation: 0; Best performing member: 103.88821157813072; Worse performing member: 103.86507745087147
The solution was found at generation: 20
parallelGA start
End of generation: 0; Best performing member: 103.9501825273037; Worse performing member: 103.95377869904041
The solution was found at generation: 28
parallelGA start
End of generation: 0; Best performing member: 103.95574349164963; Worse performing member: 103.92538088560104
The solution was found at generation: 22
parallelGA start
End of generation: 0; Best performing member: 103.92648960649967; Worse performing member: 103.951267182827
The solution was found at generation: 23
parallelGA start
End of generation: 0; Best performing member: 103.94506248831749; Worse performing member: 103.95840193331242
The solution was found at generation: 35

----- Results ------

Adversarial Example produced.
L2 norm difference: 0.4
L1 norm difference: 16
Prediction: [[8.1189455e-06 3.1421366e-04 1.3047793e-05 3.5851792e-04 5.8608407e-07
  5.2339965e-01 4.7590521e-01 6.0881990e-07 4.9827045e-09 1.2175538e-07]]
Prediction: dog
Prediction: 5
Prediction: 0.5233996510505676
 
Adversarial Example produced.
L2 norm difference: 0.4
L1 norm difference: 16
Prediction: [[1.5114491e-05 4.8687431e-04 1.6781278e-06 3.0146464e-04 5.2156207e-07
  5.8154565e-01 4.1764846e-01 1.7418236e-07 1.7101508e-08 5.1172268e-08]]
Prediction: dog
Prediction: 5
Prediction: 0.5815456509590149
 
Adversarial Example produced.
L2 norm difference: 0.44
L1 norm difference: 19
Prediction: [[9.8985379e-07 7.2723464e-04 2.0454703e-05 1.3333220e-04 4.1479296e-07
  6.4919859e-01 3.4991857e-01 2.5308287e-07 4.7106376e-08 1.2861089e-07]]
Prediction: dog
Prediction: 5
Prediction: 0.649198591709137
 
Adversarial Example produced.
L2 norm difference: 0.44
L1 norm difference: 19
Prediction: [[6.14082936e-08 3.42159794e-04 1.38723010e-06 1.12658945e-05
  1.49006851e-08 5.01281023e-01 4.98364061e-01 3.32073782e-08
  2.15935692e-09 4.77834083e-09]]
Prediction: dog
Prediction: 5
Prediction: 0.5012810230255127
 
Adversarial Example produced.
L2 norm difference: 0.47
L1 norm difference: 23
Prediction: [[3.2959793e-05 4.5766516e-04 3.5152236e-05 2.2753004e-02 7.6217566e-07
  5.2089858e-01 4.5581976e-01 1.5793808e-06 2.3750882e-08 5.2391113e-07]]
Prediction: dog
Prediction: 5
Prediction: 0.5208985805511475
 
 
----- EXPERIMENT 3: High ConfidenceParallel GA -----
parallelGA High Confidence start
