Loading cifar10_dnn.h5...
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2320        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           activation_1[0][0]               
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2320        activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2320        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 16)   64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           activation_3[0][0]               
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 16)   2320        activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 16)   2320        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 16)   64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           activation_5[0][0]               
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   4640        activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 32)   128         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9248        activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 32)   544         activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           conv2d_10[0][0]                  
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 32)   9248        activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 32)   128         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 32)   9248        activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 32)   128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           activation_9[0][0]               
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 32)   9248        activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 32)   128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 32)   9248        activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 32)   128         conv2d_14[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           activation_11[0][0]              
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     18496       activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 64)     256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 64)     36928       activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 64)     2112        activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 64)     256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           conv2d_17[0][0]                  
                                                                 batch_normalization_15[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 64)     36928       activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 64)     256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 64)     36928       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 64)     256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           activation_15[0][0]              
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 64)     36928       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 64)     256         conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 64)     36928       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 64)     256         conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           activation_17[0][0]              
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 64)           0           activation_19[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           650         global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 10)           0           dense_1[0][0]                    
==================================================================================================
Total params: 274,442
Trainable params: 273,066
Non-trainable params: 1,376
__________________________________________________________________________________________________
Input shape: (50000, 32, 32, 3)
Output shape: (50000, 10)
Image Number: 2026
5
Prediction: [[8.69501086e-13 2.59667665e-09 3.62080646e-05 4.36161049e-02
  1.79525884e-03 6.34183109e-01 1.14899294e-07 3.20369154e-01
  1.25515778e-10 2.73292305e-10]]
Prediction: dog
Prediction: 5
Prediction: 0.6341831088066101
End of generation: 0; Best performing member: 54.36649705469608; Worse performing member: 202.36077198415026
1
Loading cifar10_dnn.h5...
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2320        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           activation_1[0][0]               
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2320        activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2320        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 16)   64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           activation_3[0][0]               
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 16)   2320        activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 16)   2320        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 16)   64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           activation_5[0][0]               
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   4640        activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 32)   128         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9248        activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 32)   544         activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           conv2d_10[0][0]                  
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 32)   9248        activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 32)   128         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 32)   9248        activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 32)   128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           activation_9[0][0]               
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 32)   9248        activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 32)   128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 32)   9248        activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 32)   128         conv2d_14[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           activation_11[0][0]              
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     18496       activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 64)     256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 64)     36928       activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 64)     2112        activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 64)     256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           conv2d_17[0][0]                  
                                                                 batch_normalization_15[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 64)     36928       activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 64)     256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 64)     36928       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 64)     256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           activation_15[0][0]              
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 64)     36928       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 64)     256         conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 64)     36928       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 64)     256         conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           activation_17[0][0]              
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 64)           0           activation_19[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           650         global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 10)           0           dense_1[0][0]                    
==================================================================================================
Total params: 274,442
Trainable params: 273,066
Non-trainable params: 1,376
__________________________________________________________________________________________________
Input shape: (50000, 32, 32, 3)
Output shape: (50000, 10)
Image Number: 2026
5
Prediction: [[8.69501086e-13 2.59667665e-09 3.62080646e-05 4.36161049e-02
  1.79525884e-03 6.34183109e-01 1.14899294e-07 3.20369154e-01
  1.25515778e-10 2.73292305e-10]]
Prediction: dog
Prediction: 5
Prediction: 0.6341831088066101
End of generation: 0; Best performing member: 56.66690844297409; Worse performing member: 173.4352454307886
1
End of generation: 0; Best performing member: 55.19907879829407; Worse performing member: 206.88160229513542
1
0
End of generation: 0; Best performing member: 65.41003379225731; Worse performing member: 228.47593471227157
1
0

----- Results ------

Adversarial Example produced.
L2 norm difference: 0.14
L1 norm difference: 2
Time: 29.7394456
Generation: 1
Prediction: [[7.18172863e-13 2.11224416e-09 2.81199300e-05 7.49690831e-02
  1.61897286e-03 4.23097491e-01 1.14422143e-07 5.00286222e-01
  1.05661264e-10 1.89959160e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.5002862215042114


Adversarial Example produced.
L2 norm difference: 0.14
L1 norm difference: 2
Time: 27.709508899999996
Generation: 1
Prediction: [[9.3405134e-13 2.5073665e-09 8.6803186e-05 8.9353681e-02 2.7094765e-03
  4.2858765e-01 2.1908531e-07 4.7926217e-01 2.0642221e-10 3.8199513e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.47926217317581177


Adversarial Example produced.
L2 norm difference: 0.24
L1 norm difference: 7
Time: 27.839171399999998
Generation: 1
Prediction: [[1.9988121e-12 4.6485016e-09 1.0467332e-04 3.7447404e-02 1.1663655e-02
  4.7519055e-01 2.7097354e-07 4.7559348e-01 2.3818592e-10 6.3243399e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.4755934774875641


Adversarial Example produced.
L2 norm difference: 0.62
L1 norm difference: 42
Time: 2.4073259000000036
Generation: 0
Prediction: [[3.5466037e-13 1.1057041e-09 2.2610273e-05 5.0909976e-03 3.4027654e-03
  4.1356844e-01 8.7631797e-08 5.7791513e-01 1.5577729e-10 7.6264620e-11]]
Prediction: horse
Prediction: 7
Prediction: 0.5779151320457458


Adversarial Example produced.
L2 norm difference: 0.66
L1 norm difference: 45
Time: 2.4203902
Generation: 0
Prediction: [[2.4385187e-11 2.7244807e-08 1.3120595e-03 8.7552249e-02 2.3701140e-03
  1.1631434e-01 1.2778394e-05 7.9243839e-01 3.7150183e-09 8.2440303e-09]]
Prediction: horse
Prediction: 7
Prediction: 0.7924383878707886


 
----- EXPERIMENT 2: Parallel GA -----
parallelGA start
The solution was found at generation: 0
parallelGA start
The solution was found at generation: 0
parallelGA start
The solution was found at generation: 0
parallelGA start
End of generation: 0; Best performing member: 56.73191326856613; Worse performing member: 60.31841631233692
The solution was found at generation: 1
parallelGA start
The solution was found at generation: 0

----- Results ------

Adversarial Example produced.
L2 norm difference: 0.14
L1 norm difference: 2
Time: 15.86276989999999
Generation: 1
Prediction: [[4.3670173e-13 1.8032201e-09 2.1513908e-05 4.4099160e-02 1.2879596e-03
  4.7712493e-01 5.6420593e-08 4.7746634e-01 8.5195753e-11 1.6547995e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.477466344833374
 
Adversarial Example produced.
L2 norm difference: 0.37
L1 norm difference: 14
Time: 0.8553775999999971
Generation: 0
Prediction: [[2.6282297e-12 1.1520650e-08 7.5333170e-05 5.0890814e-03 1.9310066e-02
  2.0970617e-01 9.1669264e-08 7.6581925e-01 4.1697634e-10 7.6602169e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.765819251537323
 
Adversarial Example produced.
L2 norm difference: 0.37
L1 norm difference: 15
Time: 0.9030260999999911
Generation: 0
Prediction: [[3.2270746e-13 1.0091959e-09 1.4271763e-04 1.9049969e-02 3.2090577e-03
  1.0512828e-01 2.9120434e-07 8.7246966e-01 7.2505744e-11 1.7907185e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.8724696636199951
 
Adversarial Example produced.
L2 norm difference: 0.37
L1 norm difference: 15
Time: 5.257748700000008
Generation: 0
Prediction: [[7.3486784e-13 2.0612858e-09 1.7945822e-04 5.1005262e-01 1.4240111e-03
  3.6292312e-01 4.7888712e-08 1.2542079e-01 2.4800989e-10 5.5193150e-10]]
Prediction: cat
Prediction: 3
Prediction: 0.5100526213645935
 
Adversarial Example produced.
L2 norm difference: 0.38
L1 norm difference: 15
Time: 9.549538899999988
Generation: 0
Prediction: [[7.8001180e-13 1.3795497e-09 5.2294108e-05 3.4604561e-02 1.4334887e-03
  1.6670263e-01 1.7663110e-07 7.9720682e-01 2.0310861e-10 1.5906823e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.7972068190574646
 
 
----- EXPERIMENT 3: High ConfidenceParallel GA -----
parallelGA High Confidence start
End of generation: 0; Best performing member: 54.546570137143135; Worse performing member: 57.39097970724106
The solution was found at generation: 6
parallelGA High Confidence start
End of generation: 0; Best performing member: 56.16674202680588; Worse performing member: 61.73406030237675
The solution was found at generation: 6
parallelGA High Confidence start
End of generation: 0; Best performing member: -1; Worse performing member: -1
The solution was found at generation: 6
parallelGA High Confidence start
End of generation: 0; Best performing member: -1; Worse performing member: 64.86568826436996
The solution was found at generation: 9
parallelGA High Confidence start
End of generation: 0; Best performing member: 61.189005851745605; Worse performing member: 66.48134879022837
The solution was found at generation: 7

----- Results ------

HighConfidence Adversarial Example produced.
L2 norm difference: 0.26
L1 norm difference: 7
Time: 62.642960000000016
Generation: 6
Prediction: [[1.2295039e-12 2.7560076e-09 2.1560349e-04 3.7613712e-02 7.8799613e-03
  5.3694364e-02 2.7575408e-07 9.0059590e-01 1.5775149e-10 3.0542599e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.9005959033966064
 
HighConfidence Adversarial Example produced.
L2 norm difference: 0.32
L1 norm difference: 10
Time: 54.72628729999997
Generation: 7
Prediction: [[6.3759013e-13 1.4184076e-09 1.4578402e-05 2.3953321e-03 5.1274635e-03
  8.4790230e-02 3.9768334e-08 9.0767246e-01 4.5694237e-11 2.3152749e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.9076724648475647
 
HighConfidence Adversarial Example produced.
L2 norm difference: 0.37
L1 norm difference: 14
Time: 52.374961600000006
Generation: 6
Prediction: [[8.2695195e-13 4.2515995e-09 1.1266383e-03 1.5561745e-02 1.5918411e-02
  5.4810431e-02 1.0261659e-07 9.1258270e-01 1.9356604e-10 2.9840552e-10]]
Prediction: horse
Prediction: 7
Prediction: 0.9125826954841614
 
HighConfidence Adversarial Example produced.
L2 norm difference: 0.4
L1 norm difference: 16
Time: 71.9955898
Generation: 9
Prediction: [[3.6022173e-13 9.6708230e-10 2.8195029e-05 8.2856370e-03 1.1767636e-03
  8.9642361e-02 1.0035817e-08 9.0086704e-01 6.8727996e-11 5.5806557e-11]]
Prediction: horse
Prediction: 7
Prediction: 0.9008670449256897
 
HighConfidence Adversarial Example produced.
L2 norm difference: 0.43
L1 norm difference: 21
Time: 46.897061199999996
Generation: 6
Prediction: [[1.7470967e-13 4.0043710e-10 3.9814685e-07 9.0703636e-01 5.0556182e-04
  9.0089463e-02 2.2390163e-09 2.3681670e-03 3.1452228e-12 4.6803852e-11]]
Prediction: cat
Prediction: 3
Prediction: 0.9070363640785217
 





END OF PROGRAM EXECUTION
Total Time:  443.81935
